reports/issue_134_raw_artifacts/raw_results/prefix-repetition-online/24/rep-1/bench.log
/root/vllm/vllm-hust/vllm/__init__.py:7: RuntimeWarning: Failed to read commit hash:
cannot import name '_version' from partially initialized module 'vllm' (most likely due to a circular import) (/root/vllm/vllm-hust/vllm/__init__.py)
  from .version import (  # isort:skip
INFO 08-05 08:33:07 [__init__.py:44] Available plugins for group vllm.platform_plugins:
INFO 08-05 08:33:07 [__init__.py:46] - ascend -> vllm_ascend:register
INFO 08-05 08:33:07 [__init__.py:58] Loading plugin ascend
INFO 08-05 08:33:07 [__init__.py:246] Platform plugin ascend is activated
INFO 08-05 08:33:07 [platform.py:60] Breakable cudagraph is force disabled on Ascend because DeepSeek V4 PIECEWISE cudagraph is not supported yet.
WARNING 08-05 08:33:38 [importing.py:78] Triton is installed, but `triton.backends` could not be imported. Disabling Triton.
INFO 08-05 08:33:38 [importing.py:93] Triton not installed or not compatible; certain GPU-related functions will not be available.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0xfffcf0337ec0>, trust_remote_code=False, seed=0, num_prompts=200, dataset_name='prefix_repetition', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, custom_ensure_client_side_data=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, timed_trace_chunk_hash_size=16, timed_trace_sec_multiplier=1, timed_trace_label_timestamp='timestamp', timed_trace_label_input_length='input_length', timed_trace_label_output_length='output_length', timed_trace_label_hash_ids='hash_ids', blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=4096, random_output_len=256, random_range_ratio='0.0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, bfcl_categories=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='vllm', base_url=None, host='127.0.0.1', port=8422, endpoint='/v1/completions', header=None, max_concurrency=None, model='/data/shared_models/Qwen--Qwen2.5-14B-Instruct', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=1.0, burstiness=1.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir='/data/issue134-results/npu2.tmp/raw_results/prefix-repetition-online/24/rep-1', result_filename='raw.json', ignore_eos=False, self_timed=None, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-305b2bbb-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, chat_template_kwargs=None, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: 1.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None

  0%|          | 0/200 [00:00<?, ?it/s]
  0%|          | 1/200 [00:14<49:44, 15.00s/it]
  1%|          | 2/200 [01:10<2:08:15, 38.86s/it]
  2%|▏         | 3/200 [01:11<1:10:03, 21.34s/it]
  2%|▏         | 4/200 [01:11<43:21, 13.27s/it]
  2%|▎         | 5/200 [01:12<28:05,  8.64s/it]
  4%|▎         | 7/200 [01:12<14:00,  4.36s/it]
  4%|▍         | 8/200 [01:13<11:00,  3.44s/it]
  5%|▌         | 10/200 [01:14<06:48,  2.15s/it]
  6%|▋         | 13/200 [01:16<04:24,  1.42s/it]
  7%|▋         | 14/200 [01:18<04:34,  1.48s/it]
  8%|▊         | 15/200 [01:20<05:19,  1.73s/it]
  8%|▊         | 16/200 [01:23<05:57,  1.94s/it]
  8%|▊         | 17/200 [01:24<04:48,  1.58s/it]
  9%|▉         | 18/200 [01:24<04:15,  1.40s/it]
 10%|▉         | 19/200 [01:25<03:52,  1.28s/it]
 10%|█         | 20/200 [01:27<04:19,  1.44s/it]
 11%|█         | 22/200 [01:28<02:42,  1.10it/s]
 12%|█▏        | 23/200 [01:29<03:02,  1.03s/it]
 12%|█▏        | 24/200 [01:30<02:54,  1.01it/s]
 12%|█▎        | 25/200 [01:31<02:49,  1.03it/s]
 14%|█▎        | 27/200 [01:32<02:10,  1.32it/s]
 14%|█▍        | 29/200 [01:33<01:51,  1.54it/s]
 15%|█▌        | 30/200 [01:34<01:57,  1.44it/s]
 16%|█▌        | 32/200 [01:34<01:27,  1.93it/s]
 17%|█▋        | 34/200 [01:36<01:51,  1.49it/s]
 18%|█▊        | 35/200 [01:37<01:43,  1.60it/s]
 18%|█▊        | 37/200 [01:37<01:32,  1.77it/s]
 19%|█▉        | 38/200 [01:38<01:44,  1.56it/s]
 20%|██        | 40/200 [01:39<01:31,  1.75it/s]
 21%|██        | 42/200 [01:40<01:10,  2.23it/s]
 22%|██▏       | 43/200 [01:40<01:10,  2.24it/s]
 22%|██▏       | 44/200 [01:41<01:07,  2.30it/s]
 22%|██▎       | 45/200 [01:42<01:43,  1.50it/s]
 23%|██▎       | 46/200 [01:42<01:36,  1.60it/s]
 24%|██▎       | 47/200 [01:43<01:45,  1.44it/s]
 24%|██▍       | 48/200 [01:46<02:50,  1.12s/it]
 24%|██▍       | 49/200 [01:46<02:21,  1.06it/s]
 25%|██▌       | 50/200 [01:46<01:57,  1.28it/s]
 26%|██▌       | 52/200 [01:47<01:16,  1.94it/s]
 26%|██▋       | 53/200 [01:48<01:32,  1.59it/s]
 27%|██▋       | 54/200 [01:49<01:39,  1.46it/s]
 28%|██▊       | 56/200 [01:50<01:26,  1.67it/s]
 29%|██▉       | 58/200 [01:50<01:06,  2.15it/s]
 30%|██▉       | 59/200 [01:51<01:03,  2.20it/s]
 30%|███       | 60/200 [01:51<01:17,  1.81it/s]
 30%|███       | 61/200 [01:54<02:19,  1.00s/it]
 32%|███▏      | 63/200 [01:54<01:34,  1.45it/s]
 32%|███▎      | 65/200 [01:55<01:20,  1.67it/s]
 33%|███▎      | 66/200 [01:57<01:44,  1.29it/s]
 34%|███▍      | 68/200 [01:58<01:26,  1.52it/s]
 34%|███▍      | 69/200 [01:59<01:49,  1.20it/s]
 35%|███▌      | 70/200 [02:04<03:58,  1.83s/it]
 36%|███▌      | 71/200 [02:05<03:11,  1.49s/it]
 36%|███▌      | 72/200 [02:05<02:37,  1.23s/it]
 36%|███▋      | 73/200 [02:06<02:36,  1.23s/it]
 37%|███▋      | 74/200 [02:07<02:08,  1.02s/it]
 38%|███▊      | 75/200 [02:08<02:03,  1.01it/s]
 38%|███▊      | 76/200 [02:08<01:44,  1.18it/s]
 38%|███▊      | 77/200 [02:10<02:00,  1.02it/s]
 39%|███▉      | 78/200 [02:10<01:55,  1.06it/s]
 40%|███▉      | 79/200 [02:11<01:33,  1.29it/s]
 40%|████      | 80/200 [02:12<01:36,  1.25it/s]
 40%|████      | 81/200 [02:14<02:43,  1.37s/it]
 42%|████▏     | 83/200 [02:15<01:49,  1.07it/s]
 42%|████▏     | 84/200 [02:16<01:45,  1.09it/s]
 43%|████▎     | 86/200 [02:16<01:10,  1.62it/s]
 44%|████▎     | 87/200 [02:17<01:15,  1.49it/s]
 44%|████▍     | 88/200 [02:18<01:09,  1.61it/s]
 44%|████▍     | 89/200 [02:20<01:56,  1.05s/it]
 45%|████▌     | 90/200 [02:20<01:35,  1.15it/s]
 46%|████▌     | 91/200 [02:21<01:21,  1.33it/s]
 46%|████▌     | 92/200 [02:22<01:38,  1.10it/s]
 46%|████▋     | 93/200 [02:24<02:15,  1.27s/it]
 47%|████▋     | 94/200 [02:26<02:33,  1.45s/it]
 48%|████▊     | 96/200 [02:27<01:41,  1.02it/s]
 48%|████▊     | 97/200 [02:28<01:38,  1.05it/s]
 49%|████▉     | 98/200 [02:28<01:23,  1.22it/s]
 50%|████▉     | 99/200 [02:29<01:25,  1.18it/s]
 50%|█████     | 100/200 [02:31<01:53,  1.13s/it]
 51%|█████     | 102/200 [02:32<01:12,  1.35it/s]
 52%|█████▏    | 103/200 [02:34<01:55,  1.19s/it]
 52%|█████▏    | 104/200 [02:35<01:46,  1.11s/it]
 52%|█████▎    | 105/200 [02:36<01:51,  1.18s/it]
 53%|█████▎    | 106/200 [02:37<01:41,  1.08s/it]
 54%|█████▎    | 107/200 [02:38<01:24,  1.10it/s]
 54%|█████▍    | 108/200 [02:38<01:12,  1.27it/s]
 55%|█████▍    | 109/200 [02:40<01:46,  1.17s/it]
 55%|█████▌    | 110/200 [02:42<01:49,  1.22s/it]
 56%|█████▌    | 111/200 [02:42<01:36,  1.08s/it]
 56%|█████▌    | 112/200 [02:43<01:18,  1.12it/s]
 57%|█████▋    | 114/200 [02:44<00:58,  1.47it/s]
 57%|█████▊    | 115/200 [02:44<00:53,  1.58it/s]
 58%|█████▊    | 116/200 [02:45<01:06,  1.26it/s]
 58%|█████▊    | 117/200 [02:48<01:37,  1.17s/it]
 59%|█████▉    | 118/200 [02:48<01:18,  1.04it/s]
 60%|█████▉    | 119/200 [02:52<02:27,  1.82s/it]
 60%|██████    | 120/200 [02:54<02:34,  1.93s/it]
 60%|██████    | 121/200 [02:58<03:11,  2.42s/it]
 61%|██████    | 122/200 [02:59<02:33,  1.96s/it]
 62%|██████▏   | 124/200 [03:00<01:51,  1.47s/it]
 62%|██████▎   | 125/200 [03:02<01:48,  1.45s/it]
 64%|██████▍   | 128/200 [03:02<00:55,  1.29it/s]
 64%|██████▍   | 129/200 [03:06<01:29,  1.26s/it]
 65%|██████▌   | 130/200 [03:06<01:15,  1.09s/it]
 66%|██████▌   | 131/200 [03:07<01:12,  1.05s/it]
 66%|██████▌   | 132/200 [03:07<01:01,  1.11it/s]
 66%|██████▋   | 133/200 [03:08<00:52,  1.27it/s]
 67%|██████▋   | 134/200 [03:09<01:02,  1.06it/s]
 68%|██████▊   | 135/200 [03:11<01:18,  1.20s/it]
 68%|██████▊   | 136/200 [03:12<01:03,  1.01it/s]
 68%|██████▊   | 137/200 [03:12<01:00,  1.04it/s]
 70%|██████▉   | 139/200 [03:13<00:44,  1.36it/s]
 70%|███████   | 140/200 [03:14<00:45,  1.31it/s]
 70%|███████   | 141/200 [03:15<00:53,  1.11it/s]
 71%|███████   | 142/200 [03:17<01:06,  1.15s/it]
 72%|███████▏  | 143/200 [03:19<01:07,  1.19s/it]
 72%|███████▏  | 144/200 [03:19<01:01,  1.09s/it]
 72%|███████▎  | 145/200 [03:21<01:03,  1.16s/it]
 73%|███████▎  | 146/200 [03:24<01:28,  1.64s/it]
 74%|███████▎  | 147/200 [03:24<01:08,  1.30s/it]
 74%|███████▍  | 148/200 [03:25<01:02,  1.20s/it]
 74%|███████▍  | 149/200 [03:27<01:11,  1.39s/it]
 75%|███████▌  | 150/200 [03:30<01:29,  1.79s/it]
 76%|███████▌  | 151/200 [03:31<01:15,  1.54s/it]
 76%|███████▌  | 152/200 [03:31<00:58,  1.22s/it]
 76%|███████▋  | 153/200 [03:33<01:04,  1.38s/it]
 78%|███████▊  | 155/200 [03:34<00:48,  1.07s/it]
 78%|███████▊  | 156/200 [03:35<00:40,  1.08it/s]
 78%|███████▊  | 157/200 [03:37<00:52,  1.21s/it]
 79%|███████▉  | 158/200 [03:37<00:43,  1.04s/it]
 80%|███████▉  | 159/200 [03:39<00:51,  1.25s/it]
 80%|████████  | 160/200 [03:41<00:56,  1.41s/it]
 81%|████████  | 162/200 [03:41<00:33,  1.13it/s]
 82%|████████▏ | 164/200 [03:42<00:23,  1.54it/s]
 83%|████████▎ | 166/200 [03:44<00:25,  1.31it/s]
 84%|████████▎ | 167/200 [03:45<00:28,  1.16it/s]
 84%|████████▍ | 168/200 [03:49<00:49,  1.55s/it]
 84%|████████▍ | 169/200 [03:50<00:46,  1.50s/it]
 86%|████████▌ | 171/200 [03:52<00:33,  1.15s/it]
 86%|████████▌ | 172/200 [03:53<00:32,  1.17s/it]
 86%|████████▋ | 173/200 [03:54<00:31,  1.18s/it]
 87%|████████▋ | 174/200 [03:55<00:26,  1.03s/it]
 88%|████████▊ | 175/200 [03:56<00:26,  1.08s/it]
 88%|████████▊ | 176/200 [03:57<00:26,  1.10s/it]
 88%|████████▊ | 177/200 [03:58<00:21,  1.06it/s]
 89%|████████▉ | 178/200 [04:01<00:34,  1.57s/it]
 90%|████████▉ | 179/200 [04:02<00:30,  1.47s/it]
 90%|█████████ | 180/200 [04:03<00:24,  1.23s/it]
 90%|█████████ | 181/200 [04:05<00:31,  1.65s/it]
 91%|█████████ | 182/200 [04:07<00:30,  1.72s/it]
 92%|█████████▏| 183/200 [04:10<00:32,  1.94s/it]
 92%|█████████▏| 184/200 [04:10<00:24,  1.55s/it]
 92%|█████████▎| 185/200 [04:14<00:35,  2.36s/it]
 93%|█████████▎| 186/200 [04:20<00:45,  3.22s/it]
 94%|█████████▎| 187/200 [04:21<00:34,  2.65s/it]
 94%|█████████▍| 189/200 [04:22<00:18,  1.72s/it]
 95%|█████████▌| 190/200 [04:24<00:16,  1.62s/it]
 96%|█████████▌| 191/200 [04:26<00:15,  1.69s/it]
 96%|█████████▌| 192/200 [04:27<00:12,  1.51s/it]
 96%|█████████▋| 193/200 [04:27<00:08,  1.22s/it]
 97%|█████████▋| 194/200 [04:27<00:06,  1.01s/it]
 98%|█████████▊| 195/200 [04:29<00:06,  1.20s/it]
 98%|█████████▊| 196/200 [04:31<00:05,  1.42s/it]
 98%|█████████▊| 197/200 [04:32<00:04,  1.36s/it]
100%|█████████▉| 199/200 [04:33<00:00,  1.14it/s]
100%|██████████| 200/200 [04:34<00:00,  1.03it/s]
100%|██████████| 200/200 [04:34<00:00,  1.37s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     200
Failed requests:                         0
Request rate configured (RPS):           1.00
Benchmark duration (s):                  274.70
Total input tokens:                      102409
Total generated tokens:                  25328
Request throughput (req/s):              0.73
Output token throughput (tok/s):         92.20
Peak output token throughput (tok/s):    217.00
Peak concurrent requests:                76.00
Total token throughput (tok/s):          465.00
---------------Time to First Token----------------
Mean TTFT (ms):                          1231.51
Median TTFT (ms):                        1228.46
P99 TTFT (ms):                           1777.56
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          481.42
Median TPOT (ms):                        466.55
P99 TPOT (ms):                           577.52
---------------Inter-token Latency----------------
Mean ITL (ms):                           481.47
Median ITL (ms):                         467.93
P99 ITL (ms):                            682.24
==================================================